
var primary_school_student = [

  {
    "title": "枫桥夜泊",
    "dynasty": "唐代",
    "author": "张继",
    "text": "月落乌啼霜满天，\n江枫渔火对愁眠。\n姑苏城外寒山寺，\n夜半钟声到客船。"
  },
  {
    "title": "草 / 赋得古原草送别",
    "dynasty": "唐代",
    "author": "白居易",
    "text": "离离原上草，\n一岁一枯荣。\n野火烧不尽，\n春风吹又生。\n\n远芳侵古道，\n晴翠接荒城。\n又送王孙去，\n萋萋满别情。"
  },
  {
    "title": "忆江南·江南好",
    "dynasty": "唐代",
    "author": "白居易",
    "text": "江南好，\n风景旧曾谙。\n日出江花红胜火，\n春来江水绿如蓝。\n能不忆江南？"
  },
  {
    "title": "敕勒歌",
    "dynasty": "南北朝",
    "author": "乐府诗集",
    "text": "敕勒川，\n阴山下。\n天似穹庐，\n笼盖四野。\n天苍苍，\n野茫茫。\n风吹草低见牛羊。"
  },
  
  {
    "title": "七步诗",
    "dynasty": "两汉",
    "author": "曹植",
    "text": "煮豆燃豆萁，\n豆在釜中泣。\n本是同根生，\n相煎何太急？"
  },
  {
    "title": "春夜喜雨",
    "dynasty": "唐代",
    "author": "杜甫",
    "text": "好雨知时节，\n当春乃发生。\n随风潜入夜，\n润物细无声。\n\n野径云俱黑，\n江船火独明。\n晓看红湿处，\n花重锦官城。"
  },
  {
    "title": "江南逢李龟年",
    "dynasty": "唐代",
    "author": "杜甫",
    "text": "岐王宅里寻常见，\n崔九堂前几度闻。 \n正是江南好风景，\n落花时节又逢君。"
  },
  {
    "title": "江畔独步寻花·其六",
    "dynasty": "唐代",
    "author": "杜甫",
    "text": "黄四娘家花满蹊，\n千朵万朵压枝低。\n留连戏蝶时时舞，\n自在娇莺恰恰啼。"
  },
  {
    "title": "绝句",
    "dynasty": "唐代",
    "author": "杜甫",
    "text": "两个黄鹂鸣翠柳，\n一行白鹭上青天。\n窗含西岭千秋雪，\n门泊东吴万里船。"
  },
  {
    "title": "绝句二首",
    "dynasty": "唐代",
    "author": "杜甫",
    "text": "迟日江山丽，\n春风花草香。\n泥融飞燕子，\n沙暖睡鸳鸯。\n\n江碧鸟逾白，\n山青花欲燃。\n今春看又过，\n何日是归年。"
  },
  {
    "title": "闻官军收河南河北",
    "dynasty": "唐代",
    "author": "杜甫",
    "text": "剑外忽传收蓟北，\n初闻涕泪满衣裳。\n却看妻子愁何在，\n漫卷诗书喜欲狂。\n\n白日放歌须纵酒，\n青春作伴好还乡。\n即从巴峡穿巫峡，\n便下襄阳向洛阳。"
  },
  {
    "title": "赠花卿",
    "dynasty": "唐代",
    "author": "杜甫",
    "text": "锦城丝管日纷纷，\n半入江风半入云。 \n此曲只应天上有，\n人间能得几回闻。"
  },
  {
    "title": "江南春",
    "dynasty": "唐代",
    "author": "杜牧",
    "text": "千里莺啼绿映红，\n水村山郭酒旗风。\n南朝四百八十寺，\n多少楼台烟雨中。"
  },
  {
    "title": "山行",
    "dynasty": "唐代",
    "author": "杜牧",
    "text": "远上寒山石径斜，\n白云深处有人家。\n停车坐爱枫林晚，\n霜叶红于二月花。"
  },
  {
    "title": "四时田园杂兴·其二",
    "dynasty": "宋代",
    "author": "范成大",
    "text": "梅子金黄杏子肥，\n麦花雪白菜花稀。\n日长篱落无人过，\n惟有蜻蜓蛱蝶飞。"
  },
  {
    "title": "别董大二首",
    "dynasty": "唐代",
    "author": "高适",
    "text": "千里黄云白日曛，\n北风吹雁雪纷纷。\n莫愁前路无知己，\n天下谁人不识君。\n\n六翮飘飖私自怜，\n一离京洛十余年。\n丈夫贫贱应未足，\n今日相逢无酒钱。"
  },
  {
    "title": "己亥杂诗·其五",
    "dynasty": "清代",
    "author": "龚自珍",
    "text": "浩荡离愁白日斜，\n吟鞭东指即天涯。\n落红不是无情物，\n化作春泥更护花。"
  },
  {
    "title": "寒食",
    "dynasty": "唐代",
    "author": "韩翃",
    "text": "春城无处不飞花，\n寒食东风御柳斜。 \n日暮汉宫传蜡烛，\n轻烟散入五侯家。"
  },
  {
    "title": "回乡偶书二首·其一",
    "dynasty": "唐代",
    "author": "贺知章",
    "text": "少小离家老大回，\n乡音无改鬓毛衰。\n儿童相见不相识，\n笑问客从何处来。"
  },
  {
    "title": "咏柳 / 柳枝词",
    "dynasty": "唐代",
    "author": "贺知章",
    "text": "碧玉妆成一树高，\n万条垂下绿丝绦。\n不知细叶谁裁出，\n二月春风似剪刀。"
  },
  {
    "title": "寻隐者不遇 / 孙革访羊尊师诗",
    "dynasty": "唐代",
    "author": "贾岛",
    "text": "松下问童子，\n言师采药去。\n只在此山中，\n云深不知处。"
  },
  {
    "title": "长歌行",
    "dynasty": "两汉",
    "author": "佚名",
    "text": "青青园中葵，朝露待日晞。\n阳春布德泽，万物生光辉。\n常恐秋节至，焜黄华叶衰。\n百川东到海，何时复西归？\n少壮不努力，老大徒伤悲。"
  },
  {
    "title": "独坐敬亭山",
    "dynasty": "唐代",
    "author": "李白",
    "text": "众鸟高飞尽，\n孤云独去闲。\n相看两不厌，\n只有敬亭山。"
  },
  {
    "title": "古朗月行",
    "dynasty": "唐代",
    "author": "李白",
    "text": "小时不识月，\n呼作白玉盘。\n又疑瑶台镜，\n飞在青云端。\n仙人垂两足，\n桂树何团团。\n白兔捣药成，\n问言与谁餐？\n蟾蜍蚀圆影，\n大明夜已残。\n羿昔落九乌，\n天人清且安。\n阴精此沦惑，\n去去不足观。\n忧来其如何？\n凄怆摧心肝。"
  },
  {
    "title": "黄鹤楼送孟浩然之广陵",
    "dynasty": "唐代",
    "author": "李白",
    "text": "故人西辞黄鹤楼，\n烟花三月下扬州。\n孤帆远影碧空尽，\n唯见长江天际流。"
  },
  {
    "title": "静夜思",
    "dynasty": "唐代",
    "author": "李白",
    "text": "床前明月光，\n疑是地上霜。\n举头望明月，\n低头思故乡。"
  },
  {
    "title": "秋浦歌十七首·其十四",
    "dynasty": "唐代",
    "author": "李白",
    "text": "炉火照天地，\n红星乱紫烟。\n赧郎明月夜，\n歌曲动寒川。"
  },
  {
    "title": "望庐山瀑布",
    "dynasty": "唐代",
    "author": "李白",
    "text": "日照香炉生紫烟，\n遥看瀑布挂前川。\n飞流直下三千尺，\n疑是银河落九天。"
  },
  {
    "title": "望天门山",
    "dynasty": "唐代",
    "author": "李白",
    "text": "天门中断楚江开，\n碧水东流至此回。\n两岸青山相对出，\n孤帆一片日边来。"
  },
  {
    "title": "早发白帝城 / \n白帝下江陵",
    "dynasty": "唐代",
    "author": "李白",
    "text": "朝辞白帝彩云间，\n千里江陵一日还。\n两岸猿声啼不住，\n轻舟已过万重山。"
  },
  {
    "title": "赠汪伦",
    "dynasty": "唐代",
    "author": "李白",
    "text": "李白乘舟将欲行，\n忽闻岸上踏歌声。\n桃花潭水深千尺，\n不及汪伦送我情。"
  },
  {
    "title": "夏日绝句",
    "dynasty": "宋代",
    "author": "李清照",
    "text": "生当作人杰，\n死亦为鬼雄。\n至今思项羽，\n不肯过江东。"
  },
  {
    "title": "乐游原 / 登乐游原",
    "dynasty": "唐代",
    "author": "李商隐",
    "text": "向晚意不适，\n驱车登古原。\n夕阳无限好，\n只是近黄昏。"
  },
  {
    "title": "悯农",
    "dynasty": "宋代",
    "author": "杨万里",
    "text": "稻云不雨不多黄，\n荞麦空花早着霜。\n已分忍饥度残岁，\n更堪岁里闰添长。"
  },
  {
    "title": "悯农二首",
    "dynasty": "唐代",
    "author": "李绅",
    "text": "春种一粒粟，\n秋收万颗子。\n四海无闲田，\n农夫犹饿死。\n\n锄禾日当午，\n汗滴禾下土。\n谁知盘中餐，\n粒粒皆辛苦？"
  },
  {
    "title": "题临安邸",
    "dynasty": "宋代",
    "author": "林升",
    "text": "山外青山楼外楼，\n西湖歌舞几时休？\n暖风熏得游人醉，\n直把杭州作汴州。"
  },
  {
    "title": "逢雪宿芙蓉山主人",
    "dynasty": "唐代",
    "author": "刘长卿",
    "text": "日暮苍山远，\n天寒白屋贫。\n柴门闻犬吠，\n风雪夜归人。"
  },
  {
    "title": "浪淘沙·九曲黄河万里沙",
    "dynasty": "唐代",
    "author": "刘禹锡",
    "text": "九曲黄河万里沙，\n浪淘风簸自天涯。\n如今直上银河去，\n同到牵牛织女家。"
  },
  {
    "title": "浪淘沙·九曲黄河万里沙",
    "dynasty": "唐代",
    "author": "刘禹锡",
    "text": "九曲黄河万里沙，\n浪淘风簸自天涯。\n如今直上银河去，\n同到牵牛织女家。"
  },
  {
    "title": "望洞庭",
    "dynasty": "唐代",
    "author": "刘禹锡",
    "text": "湖光秋月两相和，\n潭面无风镜未磨。\n遥望洞庭山水翠，\n白银盘里一青螺。"
  },
  {
    "title": "乌衣巷",
    "dynasty": "唐代",
    "author": "刘禹锡",
    "text": "朱雀桥边野草花，\n乌衣巷口夕阳斜。 \n旧时王谢堂前燕，\n飞入寻常百姓家。"
  },
  {
    "title": "竹枝词二首·其一",
    "dynasty": "唐代",
    "author": "刘禹锡",
    "text": "杨柳青青江水平，\n闻郎江上踏歌声。\n东边日出西边雨，\n道是无晴却有晴。"
  },
  {
    "title": "江雪",
    "dynasty": "唐代",
    "author": "柳宗元",
    "text": "千山鸟飞绝，\n万径人踪灭。\n孤舟蓑笠翁，\n独钓寒江雪。"
  },
  {
    "title": "和张仆射塞下曲·其三",
    "dynasty": "唐代",
    "author": "卢纶",
    "text": "月黑雁飞高，\n单于夜遁逃。\n欲将轻骑逐，\n大雪满弓刀。"
  },
  {
    "title": "秋夜将晓出篱门迎凉有感二首",
    "dynasty": "宋代",
    "author": "陆游",
    "text": "迢迢天汉西南落，\n喔喔邻鸡一再鸣。\n壮志病来消欲尽，\n出门搔首怆平生。\n\n三万里河东入海，\n五千仞岳上摩天。\n遗民泪尽胡尘里，\n南望王师又一年。"
  },
  {
    "title": "示儿",
    "dynasty": "宋代",
    "author": "陆游",
    "text": "死去元知万事空，\n但悲不见九州同。\n王师北定中原日，\n家祭无忘告乃翁。"
  },
  {
    "title": "咏鹅",
    "dynasty": "唐代",
    "author": "骆宾王",
    "text": "鹅，鹅，鹅，\n曲项向天歌。\n白毛浮绿水，\n红掌拨清波。"
  },
  {
    "title": "春晓",
    "dynasty": "唐代",
    "author": "孟浩然",
    "text": "春眠不觉晓，\n处处闻啼鸟。\n夜来风雨声，\n花落知多少。"
  },
  {
    "title": "宿建德江",
    "dynasty": "唐代",
    "author": "孟浩然",
    "text": "移舟泊烟渚，\n日暮客愁新。\n野旷天低树，\n江清月近人。"
  },
  {
    "title": "游子吟",
    "dynasty": "唐代",
    "author": "孟郊",
    "text": "慈母手中线，游子身上衣。\n临行密密缝，意恐迟迟归。\n谁言寸草心，报得三春晖。"
  },
  {
    "title": "惠崇春江晚景二首",
    "dynasty": "宋代",
    "author": "苏轼",
    "text": "竹外桃花三两枝，\n春江水暖鸭先知。\n蒌蒿满地芦芽短，\n正是河豚欲上时。\n\n两两归鸿欲破群，\n依依还似北归人。\n遥知朔漠多风雪，\n更待江南半月春。"
  },
  {
    "title": "六月二十七日望湖楼醉书",
    "dynasty": "宋代",
    "author": "苏轼",
    "text": "黑云翻墨未遮山，白雨跳珠乱入船。\n卷地风来忽吹散，望湖楼下水如天。\n放生鱼鳖逐人来，无主荷花到处开。\n水枕能令山俯仰，风船解与月裴回。\n乌菱白芡不论钱，乱系青菰裹绿盘。\n忽忆尝新会灵观，滞留江海得加餐。\n献花游女木兰桡，细雨斜风湿翠翘。\n无限芳洲生杜若，吴儿不识楚辞招。\n未成小隐聊中隐，可得长闲胜暂闲。\n我本无家更安往，故乡无此好湖山。"
  },
  {
    "title": "题西林壁",
    "dynasty": "宋代",
    "author": "苏轼",
    "text": "横看成岭侧成峰，\n远近高低各不同。\n不识庐山真面目，\n只缘身在此山中。"
  },
  {
    "title": "饮湖上初晴后雨二首·其二",
    "dynasty": "宋代",
    "author": "苏轼",
    "text": "水光潋滟晴方好，\n山色空蒙雨亦奇。\n欲把西湖比西子，\n淡妆浓抹总相宜。"
  },
  {
    "title": "泊船瓜洲",
    "dynasty": "宋代",
    "author": "王安石",
    "text": "京口瓜洲一水间，\n钟山只隔数重山。\n春风又绿江南岸，\n明月何时照我还？"
  },
  {
    "title": "梅花",
    "dynasty": "宋代",
    "author": "王安石",
    "text": "墙角数枝梅，\n凌寒独自开。\n遥知不是雪，\n为有暗香来。"
  },
  {
    "title": "元日",
    "dynasty": "宋代",
    "author": "王安石",
    "text": "爆竹声中一岁除，\n春风送暖入屠苏。\n千门万户曈曈日，\n总把新桃换旧符。"
  },
  {
    "title": "出塞二首·其一",
    "dynasty": "唐代",
    "author": "王昌龄",
    "text": "秦时明月汉时关，\n万里长征人未还。\n但使龙城飞将在，\n不教胡马度阴山。"
  },
  {
    "title": "从军行七首·其四",
    "dynasty": "唐代",
    "author": "王昌龄",
    "text": "青海长云暗雪山，\n孤城遥望玉门关。\n黄沙百战穿金甲，\n不破楼兰终不还。"
  },
  {
    "title": "芙蓉楼送辛渐",
    "dynasty": "唐代",
    "author": "王昌龄",
    "text": "寒雨连江夜入吴，\n平明送客楚山孤。\n洛阳亲友如相问，\n一片冰心在玉壶。"
  },
  {
    "title": "凉州词二首·其一",
    "dynasty": "唐代",
    "author": "王翰",
    "text": "葡萄美酒夜光杯，\n欲饮琵琶马上催。\n醉卧沙场君莫笑，\n古来征战几人回？"
  },
  {
    "title": "墨梅",
    "dynasty": "元代",
    "author": "王冕",
    "text": "吾家洗砚池头树，个个花开淡墨痕。\n不要人夸好颜色，只流清气满乾坤。\n\n我家洗砚池边树，朵朵花开淡墨痕。\n不要人夸颜色好，只留清气满乾坤。"
  },
  {
    "title": "朝天子·咏喇叭",
    "dynasty": "明代",
    "author": "王磐",
    "text": "喇叭，唢呐，曲儿小腔儿大。\n官船来往乱如麻，全仗你抬声价。\n军听了军愁，民听了民怕。\n哪里去辨甚么真共假？\n眼见的吹翻了这家，\n吹伤了那家，\n只吹的水尽鹅飞罢！"
  },
  {
    "title": "九月九日忆山东兄弟",
    "dynasty": "唐代",
    "author": "王维",
    "text": "独在异乡为异客，\n每逢佳节倍思亲。\n遥知兄弟登高处，\n遍插茱萸少一人。 "
  },
  {
    "title": "鹿柴",
    "dynasty": "唐代",
    "author": "王维",
    "text": "空山不见人，\n但闻人语响。\n返景入深林，\n复照青苔上。"
  },
  {
    "title": "送元二使安西 / 渭城曲",
    "dynasty": "唐代",
    "author": "王维",
    "text": "渭城朝雨浥轻尘，\n客舍青青柳色新。\n劝君更尽一杯酒，\n西出阳关无故人。"
  },
  {
    "title": "竹里馆",
    "dynasty": "唐代",
    "author": "王维",
    "text": "独坐幽篁里，\n弹琴复长啸。\n深林人不知，\n明月来相照。"
  },
  {
    "title": "登鹳雀楼",
    "dynasty": "唐代",
    "author": "王之涣",
    "text": "白日依山尽，\n黄河入海流。\n欲穷千里目，\n更上一层楼。"
  },
  {
    "title": "凉州词二首·其一",
    "dynasty": "唐代",
    "author": "王之涣",
    "text": "黄河远上白云间，\n一片孤城万仞山。\n羌笛何须怨杨柳，\n春风不度玉门关。"
  },
  {
    "title": "滁州西涧",
    "dynasty": "唐代",
    "author": "韦应物",
    "text": "独怜幽草涧边生，\n上有黄鹂深树鸣。 \n春潮带雨晚来急，\n野渡无人舟自横。"
  },
  {
    "title": "商山早行",
    "dynasty": "唐代",
    "author": "温庭筠",
    "text": "晨起动征铎，客行悲故乡。\n鸡声茅店月，人迹板桥霜。\n槲叶落山路，枳花明驿墙。\n因思杜陵梦，凫雁满回塘。"
  },
  {
    "title": "菩萨蛮·书江西造口壁",
    "dynasty": "宋代",
    "author": "辛弃疾",
    "text": "郁孤台下清江水，\n中间多少行人泪。\n西北望长安，\n可怜无数山。\n青山遮不住，\n毕竟东流去。\n江晚正愁余，\n山深闻鹧鸪。 "
  },
  {
    "title": "小池",
    "dynasty": "宋代",
    "author": "杨万里",
    "text": "泉眼无声惜细流，\n树阴照水爱晴柔。\n小荷才露尖尖角，\n早有蜻蜓立上头。"
  },
  {
    "title": "晓出净慈寺送林子方",
    "dynasty": "宋代",
    "author": "杨万里",
    "text": "毕竟西湖六月中，\n风光不与四时同。\n接天莲叶无穷碧，\n映日荷花别样红。"
  },
  {
    "title": "游园不值",
    "dynasty": "宋代",
    "author": "叶绍翁",
    "text": "应怜屐齿印苍苔，\n小扣柴扉久不开。\n春色满园关不住，\n一枝红杏出墙来。"
  },
  {
    "title": "石灰吟",
    "dynasty": "明代",
    "author": "于谦",
    "text": "千锤万凿出深山，\n烈火焚烧若等闲。\n粉骨碎身全不怕，\n要留清白在人间。"
  },
  {
    "title": "渔歌子·西塞山前白鹭飞",
    "dynasty": "唐代",
    "author": "张志和",
    "text": "西塞山前白鹭飞，\n桃花流水鳜鱼肥。\n青箬笠，绿蓑衣，\n斜风细雨不须归。"
  },
  {
    "title": "竹石",
    "dynasty": "清代",
    "author": "郑燮(xie四声）",
    "text": "咬定青山不放松，\n立根原在破岩中。\n千磨万击还坚劲，\n任尔东西南北风。"
  },
  {
    "title": "春日",
    "dynasty": "宋代",
    "author": "朱熹",
    "text": "胜日寻芳泗水滨，\n无边光景一时新。\n等闲识得东风面，\n万紫千红总是春。"
  },
]

//定义数据出口
module.exports = {
  dataList: primary_school_student
}