var dm_data = [
  {
    dmText:[
      // "暑假过半啦", "去那么多地方玩了啊", "作业写完了么", "看了哪些书", "和妹妹玩的开心吧", "热不热", "合肥高温", "新闻上说北京也好热",
      // "这首诗你肯定会背了吧", "还有一个月就要二年级咯", "日记", "每天生活多么丰富", "记下来了么，有没有啥好玩的事情","厕所门口还是公园出口，hahaha","有没有啥别的好玩的笑话", "说一个来听听吧",
      // "游泳", "要是去游泳了", "可一定要主要安全", "英语", "mama教你英语了么", "钢琴", "坚持练习了么", "别回来什么都忘记了", "还是要记得老师跟你说的要点", "多多练习",
      // "叮嘱要求太没意思了。。。","哈哈哈哈","前方高能","昨晚听的每日阅读","井底之蛙","简直说的太好了","成语故事确实增长知识","2019年7月31日","今天是李清照的古诗","夏日绝句",
      // "好期待你今天会背什么诗呢","会读什么成语故事","高能",
      // "好好学习，天天向上","热爱祖国","关爱同学","尊敬老师","独立思考","相信自己","教师节给老师送啥礼物呢？",
      ""
    ]  
  },
  {
    dmText: [
      "哈哈", "哈哈哈哈", "前方高能", "好诗", "好诗啊真是一首好诗", "哈哈555", "哈哈哈哈33", "前方高能", "好诗1", "好诗啊真是一首好诗!!!",
    ]
  },


]

//定义数据出口
module.exports = {
  dataList: dm_data
}